<template>
    <section class="faq">
        <h2 class="headline headline_secondary">
            <div class="text-line"></div>
            <span>Вопросы и ответы</span>
        </h2>
        <div v-for="(faq, index) in faqData" :key="faq" class="accordion-item" @click="toggleAccordion(index)">
            <div class="question" :class="{ active: activeIndex === index }">
                <span>{{ faq.question }}</span>
                <svg :class="{ active: activeIndex === index }" width="48" height="48" viewBox="0 0 48 48" fill="none"
                    xmlns="http://www.w3.org/2000/svg">
                    <path v-if="activeIndex === index" style="display: none;"
                        d="M24 45C18.4305 45 13.089 42.7875 9.15076 38.8492C5.21249 34.911 3 29.5695 3 24C3 18.4305 5.21249 13.089 9.15076 9.15076C13.089 5.21249 18.4305 3 24 3C29.5695 3 34.911 5.21249 38.8492 9.15076C42.7875 13.089 45 18.4305 45 24C45 29.5695 42.7875 34.911 38.8492 38.8492C34.911 42.7875 29.5695 45 24 45ZM24 48C30.3652 48 36.4697 45.4714 40.9706 40.9706C45.4714 36.4697 48 30.3652 48 24C48 17.6348 45.4714 11.5303 40.9706 7.02944C36.4697 2.52856 30.3652 0 24 0C17.6348 0 11.5303 2.52856 7.02944 7.02944C2.52856 11.5303 0 17.6348 0 24C0 30.3652 2.52856 36.4697 7.02944 40.9706C11.5303 45.4714 17.6348 48 24 48Z"
                        fill="#231F20" />
                    <path v-if="activeIndex === index" style="display: none;"
                        d="M24 12C24.3978 12 24.7794 12.158 25.0607 12.4393C25.342 12.7206 25.5 13.1022 25.5 13.5V22.5H34.5C34.8978 22.5 35.2794 22.658 35.5607 22.9393C35.842 23.2206 36 23.6022 36 24C36 24.3978 35.842 24.7794 35.5607 25.0607C35.2794 25.342 34.8978 25.5 34.5 25.5H25.5V34.5C25.5 34.8978 25.342 35.2794 25.0607 35.5607C24.7794 35.842 24.3978 36 24 36C23.6022 36 23.2206 35.842 22.9393 35.5607C22.658 35.2794 22.5 34.8978 22.5 34.5V25.5H13.5C13.1022 25.5 12.7206 25.342 12.4393 25.0607C12.158 24.7794 12 24.3978 12 24C12 23.6022 12.158 23.2206 12.4393 22.9393C12.7206 22.658 13.1022 22.5 13.5 22.5H22.5V13.5C22.5 13.1022 22.658 12.7206 22.9393 12.4393C23.2206 12.158 23.6022 12 24 12Z"
                        fill="#231F20" />
                    <path v-if="activeIndex != index" style="display: block;"
                        d="M24 45C18.4305 45 13.089 42.7875 9.15076 38.8492C5.21249 34.911 3 29.5695 3 24C3 18.4305 5.21249 13.089 9.15076 9.15076C13.089 5.21249 18.4305 3 24 3C29.5695 3 34.911 5.21249 38.8492 9.15076C42.7875 13.089 45 18.4305 45 24C45 29.5695 42.7875 34.911 38.8492 38.8492C34.911 42.7875 29.5695 45 24 45ZM24 48C30.3652 48 36.4697 45.4714 40.9706 40.9706C45.4714 36.4697 48 30.3652 48 24C48 17.6348 45.4714 11.5303 40.9706 7.02944C36.4697 2.52856 30.3652 0 24 0C17.6348 0 11.5303 2.52856 7.02944 7.02944C2.52856 11.5303 0 17.6348 0 24C0 30.3652 2.52856 36.4697 7.02944 40.9706C11.5303 45.4714 17.6348 48 24 48Z"
                        fill="#231F20" />
                    <path v-if="activeIndex != index" style="display: block;"
                        d="M24 12C24.3978 12 24.7794 12.158 25.0607 12.4393C25.342 12.7206 25.5 13.1022 25.5 13.5V22.5H34.5C34.8978 22.5 35.2794 22.658 35.5607 22.9393C35.842 23.2206 36 23.6022 36 24C36 24.3978 35.842 24.7794 35.5607 25.0607C35.2794 25.342 34.8978 25.5 34.5 25.5H25.5V34.5C25.5 34.8978 25.342 35.2794 25.0607 35.5607C24.7794 35.842 24.3978 36 24 36C23.6022 36 23.2206 35.842 22.9393 35.5607C22.658 35.2794 22.5 34.8978 22.5 34.5V25.5H13.5C13.1022 25.5 12.7206 25.342 12.4393 25.0607C12.158 24.7794 12 24.3978 12 24C12 23.6022 12.158 23.2206 12.4393 22.9393C12.7206 22.658 13.1022 22.5 13.5 22.5H22.5V13.5C22.5 13.1022 22.658 12.7206 22.9393 12.4393C23.2206 12.158 23.6022 12 24 12Z"
                        fill="#231F20" />
                    <path v-if="activeIndex === index" style="display: block;"
                        d="M48 24.002C48 30.3671 45.4714 36.4716 40.9706 40.9725C36.4697 45.4734 30.3652 48.002 24 48.002C17.6348 48.002 11.5303 45.4734 7.02944 40.9725C2.52856 36.4716 0 30.3671 0 24.002C0 17.6368 2.52856 11.5323 7.02944 7.03139C11.5303 2.53052 17.6348 0.00195313 24 0.00195312C30.3652 0.00195313 36.4697 2.53052 40.9706 7.03139C45.4714 11.5323 48 17.6368 48 24.002ZM25.5 13.502C25.5 13.1041 25.342 12.7226 25.0607 12.4413C24.7794 12.16 24.3978 12.002 24 12.002C23.6022 12.002 23.2206 12.16 22.9393 12.4413C22.658 12.7226 22.5 13.1041 22.5 13.502V22.502H13.5C13.1022 22.502 12.7206 22.66 12.4393 22.9413C12.158 23.2226 12 23.6041 12 24.002C12 24.3998 12.158 24.7813 12.4393 25.0626C12.7206 25.3439 13.1022 25.502 13.5 25.502H22.5V34.502C22.5 34.8998 22.658 35.2813 22.9393 35.5626C23.2206 35.8439 23.6022 36.002 24 36.002C24.3978 36.002 24.7794 35.8439 25.0607 35.5626C25.342 35.2813 25.5 34.8998 25.5 34.502V25.502H34.5C34.8978 25.502 35.2794 25.3439 35.5607 25.0626C35.842 24.7813 36 24.3998 36 24.002C36 23.6041 35.842 23.2226 35.5607 22.9413C35.2794 22.66 34.8978 22.502 34.5 22.502H25.5V13.502Z"
                        fill="#231F20" />
                </svg>
            </div>
            <div class="answer" :class="{ active: activeIndex === index }">{{ faq.answer }}</div>
        </div>
    </section>
</template>

<script>
export default {
    name: 'FaqBlock',

    data() {
        return {
            activeIndex: null,
            faqData: [
                { question: 'Где его взять?', answer: 'За прошедшие годы текст Lorem Ipsum получил много версий' },
                { question: 'Абзац 1.10.33 "de Finibus Bonorum et Malorum", написанный Цицероном в 45 году н.э.', answer: 'Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию' },
                { question: 'Почему он используется?', answer: 'Есть много вариантов Lorem Ipsum, но большинство из них имеет не всегда приемлемые модификации, например, юмористические вставки или слова, которые даже отдалённо не напоминают латынь. Если вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите какой-нибудь шутки, скрытой в середине абзаца. Также все другие известные генераторы Lorem Ipsum используют один и тот же текст, который они просто повторяют, пока не достигнут нужный объём. Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum генератором. Он использует словарь из более чем 200 латинских слов, а также набор моделей предложений. В результате сгенерированный Lorem Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или "невозможных" слов.' },
                { question: 'Английский перевод 1914 года, H. Rackham', answer: 'Многие программы электронной вёрстки и редакторы HTML используют Lorem Ipsum в качестве текста по умолчанию' },
                { question: 'Классический текст Lorem Ipsum, используемый с XVI века', answer: 'Это делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum генератором.' }
            ],
        };
    },
    methods: {
        toggleAccordion(index) {
            if (this.activeIndex === index) {
                this.activeIndex = null;
            } else {
                this.activeIndex = index;
            }
        }
    }
}
</script>
<style scoped lang="scss">
.faq {
    display: flex;
    flex-direction: column;
    width: 1200px;
    max-width: 100%;
    margin: 120px auto 0;
    align-items: flex-start;
    justify-content: flex-start;
    row-gap: 16px;
}

.accordion-item {
    display: flex;
    flex-direction: column;
    border-bottom: 2px solid #EEEDEE;
    width: 100%;
}

.question {
    color: #231f20;
    min-height: 40px;
    padding: 4px 0;
    font-size: 18px;
    font-weight: 600;
    line-height: 30.6px;
    letter-spacing: 0.02em;
    display: grid;
    grid-template-columns: 1fr 48px;
    justify-content: space-between;
    align-items: center;
    cursor: pointer;
}

.answer {
    padding: 0;
    font-size: 16px;
    font-weight: 400;
    line-height: 24px;
    color: #444041;
    overflow: hidden;
    max-height: 0;
}

.answer.active {
    padding: 20px 0;
    max-height: max-content;
}

svg {
    path {
        :nth-child(3) {
            opacity: 0;
            display: none;
        }
    }
}

svg.active {
    path {
        :nth-child(1) {
            display: none;
        }

        :nth-child(2) {
            display: none;
        }

        :nth-child(3) {
            display: block;
        }
    }
}

@media(max-width:1080px) {
    .faq {
        margin-top: 80px;
        padding: 0 40px;
    }

    .question {
        font-size: 18px;
        font-weight: 600;
        line-height: 30px;
        letter-spacing: 0.02em;
    }

    .answer {
        font-size: 16px;
        font-weight: 400;
        line-height: 24px;
    }
}
@media(max-width:610px){
    .faq{
        margin-top: 60px;
        padding: 0 16px;
    }
    .question {
        svg{
            transform: scale(0.58);
        }
    }
}
</style>